profiling/stage5/stage-5_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.204ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.196ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms  589.08us  15.14ms   79.70%
    Req/Sec   527.83     74.19     1.30k    84.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.44ms
 90.000%    1.75ms
 99.000%    2.69ms
 99.900%    6.95ms
 99.990%   13.72ms
 99.999%   15.15ms
100.000%   15.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.183     0.000000            1         1.00
       0.571     0.100000         5012         1.11
       0.732     0.200000        10004         1.25
       0.872     0.300000        15025         1.43
       1.004     0.400000        20027         1.67
       1.129     0.500000        25006         2.00
       1.190     0.550000        27535         2.22
       1.247     0.600000        29994         2.50
       1.310     0.650000        32514         2.86
       1.371     0.700000        34996         3.33
       1.443     0.750000        37507         4.00
       1.483     0.775000        38745         4.44
       1.528     0.800000        39996         5.00
       1.576     0.825000        41264         5.71
       1.628     0.850000        42497         6.67
       1.687     0.875000        43752         8.00
       1.717     0.887500        44353         8.89
       1.751     0.900000        44983        10.00
       1.793     0.912500        45607        11.43
       1.834     0.925000        46232        13.33
       1.883     0.937500        46862        16.00
       1.913     0.943750        47167        17.78
       1.943     0.950000        47485        20.00
       1.979     0.956250        47791        22.86
       2.020     0.962500        48103        26.67
       2.065     0.968750        48419        32.00
       2.097     0.971875        48580        35.56
       2.131     0.975000        48730        40.00
       2.175     0.978125        48883        45.71
       2.223     0.981250        49037        53.33
       2.303     0.984375        49195        64.00
       2.359     0.985938        49274        71.11
       2.443     0.987500        49350        80.00
       2.579     0.989062        49428        91.43
       2.755     0.990625        49506       106.67
       3.011     0.992188        49584       128.00
       3.209     0.992969        49623       142.22
       3.383     0.993750        49662       160.00
       3.619     0.994531        49701       182.86
       3.905     0.995313        49740       213.33
       4.167     0.996094        49779       256.00
       4.355     0.996484        49800       284.44
       4.575     0.996875        49818       320.00
       4.943     0.997266        49838       365.71
       5.315     0.997656        49857       426.67
       5.839     0.998047        49877       512.00
       6.027     0.998242        49887       568.89
       6.191     0.998437        49897       640.00
       6.447     0.998633        49906       731.43
       6.655     0.998828        49916       853.33
       7.019     0.999023        49926      1024.00
       7.327     0.999121        49931      1137.78
       7.443     0.999219        49935      1280.00
       7.687     0.999316        49940      1462.86
       7.983     0.999414        49945      1706.67
       9.223     0.999512        49950      2048.00
       9.511     0.999561        49953      2275.56
      10.231     0.999609        49955      2560.00
      10.535     0.999658        49957      2925.71
      10.855     0.999707        49960      3413.33
      11.023     0.999756        49962      4096.00
      11.343     0.999780        49964      4551.11
      11.671     0.999805        49965      5120.00
      11.703     0.999829        49966      5851.43
      11.807     0.999854        49967      6826.67
      11.959     0.999878        49968      8192.00
      13.719     0.999890        49969      9102.22
      13.927     0.999902        49970     10240.00
      13.927     0.999915        49970     11702.86
      13.951     0.999927        49971     13653.33
      13.951     0.999939        49971     16384.00
      14.071     0.999945        49972     18204.44
      14.071     0.999951        49972     20480.00
      14.071     0.999957        49972     23405.71
      15.055     0.999963        49973     27306.67
      15.055     0.999969        49973     32768.00
      15.055     0.999973        49973     36408.89
      15.055     0.999976        49973     40960.00
      15.055     0.999979        49973     46811.43
      15.151     0.999982        49974     54613.33
      15.151     1.000000        49974          inf
#[Mean    =        1.172, StdDeviation   =        0.589]
#[Max     =       15.144, Total count    =        49974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59995 requests in 1.00m, 4.14MB read
  Non-2xx or 3xx responses: 1
Requests/sec:    999.89
Transfer/sec:     70.59KB