profiling/stage5/stage-5_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.129ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.045ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  671.62us  32.93ms   91.04%
    Req/Sec   531.42     71.97     2.22k    80.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.39ms
 90.000%    1.64ms
 99.000%    2.05ms
 99.900%    4.80ms
 99.990%   27.44ms
 99.999%   32.96ms
100.000%   32.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.204     0.000000            1         1.00
       0.509     0.100000         5016         1.11
       0.665     0.200000        10014         1.25
       0.799     0.300000        15010         1.43
       0.927     0.400000        20002         1.67
       1.044     0.500000        24997         2.00
       1.104     0.550000        27488         2.22
       1.169     0.600000        30005         2.50
       1.241     0.650000        32499         2.86
       1.316     0.700000        34996         3.33
       1.393     0.750000        37491         4.00
       1.432     0.775000        38732         4.44
       1.472     0.800000        39986         5.00
       1.514     0.825000        41229         5.71
       1.555     0.850000        42494         6.67
       1.597     0.875000        43747         8.00
       1.616     0.887500        44353         8.89
       1.638     0.900000        44978        10.00
       1.663     0.912500        45620        11.43
       1.690     0.925000        46231        13.33
       1.719     0.937500        46859        16.00
       1.736     0.943750        47177        17.78
       1.753     0.950000        47476        20.00
       1.773     0.956250        47798        22.86
       1.793     0.962500        48111        26.67
       1.816     0.968750        48418        32.00
       1.830     0.971875        48577        35.56
       1.846     0.975000        48725        40.00
       1.866     0.978125        48885        45.71
       1.895     0.981250        49042        53.33
       1.926     0.984375        49194        64.00
       1.950     0.985938        49273        71.11
       1.980     0.987500        49353        80.00
       2.017     0.989062        49428        91.43
       2.069     0.990625        49506       106.67
       2.149     0.992188        49587       128.00
       2.193     0.992969        49624       142.22
       2.303     0.993750        49663       160.00
       2.463     0.994531        49701       182.86
       2.999     0.995313        49741       213.33
       3.197     0.996094        49779       256.00
       3.301     0.996484        49799       284.44
       3.439     0.996875        49818       320.00
       3.551     0.997266        49838       365.71
       3.691     0.997656        49857       426.67
       3.893     0.998047        49877       512.00
       4.043     0.998242        49887       568.89
       4.215     0.998437        49896       640.00
       4.471     0.998633        49906       731.43
       4.627     0.998828        49916       853.33
       4.831     0.999023        49926      1024.00
       5.115     0.999121        49931      1137.78
       5.523     0.999219        49935      1280.00
       6.523     0.999316        49940      1462.86
       7.323     0.999414        49945      1706.67
      10.343     0.999512        49950      2048.00
      14.471     0.999561        49953      2275.56
      16.263     0.999609        49955      2560.00
      18.111     0.999658        49957      2925.71
      19.183     0.999707        49960      3413.33
      22.943     0.999756        49962      4096.00
      23.887     0.999780        49964      4551.11
      25.487     0.999805        49965      5120.00
      25.503     0.999829        49966      5851.43
      27.119     0.999854        49967      6826.67
      27.327     0.999878        49968      8192.00
      27.439     0.999890        49969      9102.22
      27.519     0.999902        49970     10240.00
      27.519     0.999915        49970     11702.86
      29.263     0.999927        49971     13653.33
      29.263     0.999939        49971     16384.00
      32.095     0.999945        49972     18204.44
      32.095     0.999951        49972     20480.00
      32.095     0.999957        49972     23405.71
      32.495     0.999963        49973     27306.67
      32.495     0.999969        49973     32768.00
      32.495     0.999973        49973     36408.89
      32.495     0.999976        49973     40960.00
      32.495     0.999979        49973     46811.43
      32.959     0.999982        49974     54613.33
      32.959     1.000000        49974          inf
#[Mean    =        1.087, StdDeviation   =        0.672]
#[Max     =       32.928, Total count    =        49974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59994 requests in 1.00m, 3.83MB read
Requests/sec:    999.86
Transfer/sec:     65.42KB